# PyCharm

# Ctrl+"пробел" - отображаются полный список ключевых слов, переменных, методов для использования
# Чтоб привести программу к стандарту PEP-8 - руководство по написанию кода - Alt+Ctrl+l
# Возможность пошагового редактирования программы или по прасту ее отладки - с указанием точки остановок
# Чтоб выполнить текущую строчку нажимаем Step Over или F8
# Процесс выполнения программы для отлавливания ошибок

x = 2
sgn = 0
if x < 0:
    sgn = -1
    print("x - отрицательное число")
elif x > 0:
    sgn = 1
    print("x - положительное число")
else:
    print("x - равен 0")






