   

# 4. Напишите программу определения количества
# вхождений фраз «ra» в слове «abrakadabra»
word = input("Введите слово: ")
calc = word.count("ra")
print("Определено кол-во вхождений фраз «ra» в слове «_______»: ", calc)


