

# 2. Написать программу удаления из списка
#    ['+7912123456', '+7915213456', '+6915213456', '+4915213456', '+7915213456']
#     всех номеров с кодом «+7».


lst = ['+7912123456', '+7915213456', '+6915213456', '+4915213456', '+7915213456']

# Создаем копию списка list
copyLst = list(lst)
print(id(copyLst), id(lst))
print(lst, "Копия: ",copyLst)   


lst1 = list( filter(lambda num: "+7" not in num, copyLst) )
print("Вариант 1 с копией - lambda: ", lst1)

lst2 = list( filter(lambda el: "+7" not in el, lst) )
print("Вариант 2 - lambda: ", lst2)


#  Рассматриваем значение элементов спика как строки и ищем в этих строчках подстроку '+7'
spisok = ['+3912123456', '+3915213456', '+8915213456', '+5915213456','+3915213456']
i = 0
while i < len(spisok):            # индекс бежит по списку пока i не выйдет за границы списка (длинна списка уменьшается при каждом удалении элемента)
   if '+3' in spisok[i]:
      del spisok[i]               # если в элементе есть +7 то удаляем элемент, счетчик оставляем неизменным, так как если увеличим ее то пропустим элемент который шел следом за уделенным'
   else: i += 1                   # счетчик индексов списка, прибавляем если не удалили элемент списка
print("Вариант 3 цикл  - while: ", spisok)


num = ['+7912123456', '+7915213456', '+6915213456', '+4915213456', '+7915213456']
d = []
for i in num:
    if "+7" not in i:
        d.append(i)
print("Вариант 4 цикл  - for: ", d)

print( "Вариант 5 цикл  - for: ", [i for i in num if '+7' not in i])

## c_o_n_s_o_l_e ##

#  2225427926400 2225422733056
#  ['+7912123456', '+7915213456', '+6915213456', '+4915213456', '+7915213456'] Копия:  ['+7912123456', '+7915213456', '+6915213456', '+4915213456', '+7915213456']
#  Вариант 1 с копией - lambda:  ['+6915213456', '+4915213456']
#  Вариант 2 - lambda:  ['+6915213456', '+4915213456']
#  Вариант 3 цикл  - while:  ['+8915213456', '+5915213456']
#  Вариант 4 цикл  - for:  ['+6915213456', '+4915213456']
## Вариант 5 цикл  - for:  ['+6915213456', '+4915213456']





